{"class_name": "Sequential", "keras_version": "1.1.0", "config": [{"class_name": "ConvLSTM2D", "config": {"name": "convlstm2d_1", "inner_activation": "hard_sigmoid", "go_backwards": false, "activation": "tanh", "trainable": true, "dim_ordering": "th", "nb_col": 3, "stateful": false, "init": "glorot_uniform", "inner_init": "orthogonal", "nb_filter": 40, "input_dtype": "float32", "return_sequences": true, "batch_input_shape": [null, 11, 40, 40, 1], "border_mode": "same", "forget_bias_init": "one", "nb_row": 3}}, {"class_name": "BatchNormalization", "config": {"gamma_regularizer": null, "name": "batchnormalization_1", "epsilon": 1e-05, "trainable": true, "mode": 0, "beta_regularizer": null, "momentum": 0.99, "axis": -1}}, {"class_name": "ConvLSTM2D", "config": {"name": "convlstm2d_2", "inner_activation": "hard_sigmoid", "go_backwards": false, "activation": "tanh", "trainable": true, "dim_ordering": "th", "nb_col": 3, "stateful": false, "init": "glorot_uniform", "inner_init": "orthogonal", "nb_filter": 40, "return_sequences": true, "border_mode": "same", "forget_bias_init": "one", "nb_row": 3}}, {"class_name": "BatchNormalization", "config": {"gamma_regularizer": null, "name": "batchnormalization_2", "epsilon": 1e-05, "trainable": true, "mode": 0, "beta_regularizer": null, "momentum": 0.99, "axis": -1}}, {"class_name": "Flatten", "config": {"trainable": true, "name": "flatten_1"}}, {"class_name": "Dense", "config": {"W_constraint": null, "b_constraint": null, "name": "dense_1", "activity_regularizer": null, "trainable": true, "init": "glorot_uniform", "bias": true, "input_dim": null, "b_regularizer": null, "W_regularizer": null, "activation": "linear", "output_dim": 128}}, {"class_name": "Dense", "config": {"W_constraint": null, "b_constraint": null, "name": "dense_2", "activity_regularizer": null, "trainable": true, "init": "glorot_uniform", "bias": true, "input_dim": null, "b_regularizer": null, "W_regularizer": null, "activation": "linear", "output_dim": 17600}}, {"class_name": "Reshape", "config": {"target_shape": [11, 40, 40, 1], "trainable": true, "name": "reshape_1"}}, {"class_name": "ConvLSTM2D", "config": {"name": "convlstm2d_3", "inner_activation": "hard_sigmoid", "go_backwards": false, "activation": "tanh", "trainable": true, "dim_ordering": "th", "nb_col": 3, "stateful": false, "init": "glorot_uniform", "inner_init": "orthogonal", "nb_filter": 40, "return_sequences": true, "border_mode": "same", "forget_bias_init": "one", "nb_row": 3}}, {"class_name": "BatchNormalization", "config": {"gamma_regularizer": null, "name": "batchnormalization_3", "epsilon": 1e-05, "trainable": true, "mode": 0, "beta_regularizer": null, "momentum": 0.99, "axis": -1}}, {"class_name": "ConvLSTM2D", "config": {"name": "convlstm2d_4", "inner_activation": "hard_sigmoid", "go_backwards": false, "activation": "tanh", "trainable": true, "dim_ordering": "th", "nb_col": 3, "stateful": false, "init": "glorot_uniform", "inner_init": "orthogonal", "nb_filter": 40, "return_sequences": true, "border_mode": "same", "forget_bias_init": "one", "nb_row": 3}}, {"class_name": "BatchNormalization", "config": {"gamma_regularizer": null, "name": "batchnormalization_4", "epsilon": 1e-05, "trainable": true, "mode": 0, "beta_regularizer": null, "momentum": 0.99, "axis": -1}}, {"class_name": "Convolution3D", "config": {"W_constraint": null, "b_constraint": null, "name": "convolution3d_1", "kernel_dim2": 3, "kernel_dim1": 1, "activation": "sigmoid", "trainable": true, "dim_ordering": "tf", "kernel_dim3": 3, "subsample": [1, 1, 1], "init": "glorot_uniform", "bias": true, "nb_filter": 1, "b_regularizer": null, "W_regularizer": null, "activity_regularizer": null, "border_mode": "same"}}]}