{"loss": "vae_loss", "optimizer": {"epsilon": 1e-08, "lr": 0.0010000000474974513, "name": "RMSprop", "rho": 0.8999999761581421}, "class_name": "Model", "loss_weights": null, "keras_version": "1.0.6", "config": {"layers": [{"class_name": "InputLayer", "config": {"batch_input_shape": [100, 784], "name": "input_1", "input_dtype": "float32"}, "inbound_nodes": [], "name": "input_1"}, {"class_name": "Dense", "config": {"W_constraint": null, "b_constraint": null, "name": "dense_1", "activity_regularizer": null, "trainable": true, "init": "glorot_uniform", "bias": true, "input_dim": null, "b_regularizer": null, "W_regularizer": null, "activation": "relu", "output_dim": 256}, "inbound_nodes": [[["input_1", 0, 0]]], "name": "dense_1"}, {"class_name": "Dense", "config": {"W_constraint": null, "b_constraint": null, "name": "dense_2", "activity_regularizer": null, "trainable": true, "init": "glorot_uniform", "bias": true, "input_dim": null, "b_regularizer": null, "W_regularizer": null, "activation": "linear", "output_dim": 128}, "inbound_nodes": [[["dense_1", 0, 0]]], "name": "dense_2"}, {"class_name": "Dense", "config": {"W_constraint": null, "b_constraint": null, "name": "dense_3", "activity_regularizer": null, "trainable": true, "init": "glorot_uniform", "bias": true, "input_dim": null, "b_regularizer": null, "W_regularizer": null, "activation": "linear", "output_dim": 128}, "inbound_nodes": [[["dense_1", 0, 0]]], "name": "dense_3"}, {"class_name": "Lambda", "config": {"function": "c\u0001\u0000\u0000\u0000\u0007\u0000\u0000\u0000\u0007\u0000\u0000\u0000C\u0000\u0000\u0000s[\u0000\u0000\u0000|\u0000\u0000\\\u0002\u0000}\u0001\u0000}\u0002\u0000d\u0001\u0000}\u0003\u0000d\u0002\u0000}\u0004\u0000d\u0003\u0000}\u0005\u0000t\u0000\u0000j\u0001\u0000d\u0004\u0000|\u0003\u0000|\u0004\u0000f\u0002\u0000d\u0005\u0000d\u0006\u0000d\u0007\u0000|\u0005\u0000\u0083\u0000\u0003}\u0006\u0000|\u0001\u0000t\u0000\u0000j\u0002\u0000|\u0002\u0000d\b\u0000\u0015\u0083\u0001\u0000|\u0006\u0000\u0014\u0017S(\t\u0000\u0000\u0000Nid\u0000\u0000\u0000i\u0080\u0000\u0000\u0000g{\u0014\u00aeG\u00e1z\u0084?t\u0005\u0000\u0000\u0000shapet\u0004\u0000\u0000\u0000meang\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0000t\u0003\u0000\u0000\u0000stdi\u0002\u0000\u0000\u0000(\u0003\u0000\u0000\u0000t\u0001\u0000\u0000\u0000Kt\r\u0000\u0000\u0000random_normalt\u0003\u0000\u0000\u0000exp(\u0007\u0000\u0000\u0000t\u0004\u0000\u0000\u0000argst\u0006\u0000\u0000\u0000z_meant\t\u0000\u0000\u0000z_log_vart\n\u0000\u0000\u0000batch_sizet\n\u0000\u0000\u0000latent_dimt\u000b\u0000\u0000\u0000epsilon_stdt\u0007\u0000\u0000\u0000epsilon(\u0000\u0000\u0000\u0000(\u0000\u0000\u0000\u0000s\u001a\u0000\u0000\u0000variational_autoencoder.pyt\b\u0000\u0000\u0000sampling!\u0000\u0000\u0000s\u000e\u0000\u0000\u0000\u0000\u0001\f\u0003\u0006\u0001\u0006\u0001\u0006\u0002\u001b\u0001\t\u0001", "name": "lambda_1", "trainable": true, "function_type": "lambda", "arguments": {}, "output_shape": [128], "output_shape_type": "raw"}, "inbound_nodes": [[["dense_2", 0, 0], ["dense_3", 0, 0]]], "name": "lambda_1"}, {"class_name": "Dense", "config": {"W_constraint": null, "b_constraint": null, "name": "dense_4", "activity_regularizer": null, "trainable": true, "init": "glorot_uniform", "bias": true, "input_dim": null, "b_regularizer": null, "W_regularizer": null, "activation": "relu", "output_dim": 256}, "inbound_nodes": [[["lambda_1", 0, 0]]], "name": "dense_4"}, {"class_name": "Dense", "config": {"W_constraint": null, "b_constraint": null, "name": "dense_5", "activity_regularizer": null, "trainable": true, "init": "glorot_uniform", "bias": true, "input_dim": null, "b_regularizer": null, "W_regularizer": null, "activation": "sigmoid", "output_dim": 784}, "inbound_nodes": [[["dense_4", 0, 0]]], "name": "dense_5"}], "input_layers": [["input_1", 0, 0]], "output_layers": [["dense_5", 0, 0]], "name": "model_1"}, "sample_weight_mode": null}